---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.AirChangesPerHour
source: html/de814e90-ca51-87fc-7978-2bda93282508.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.AirChangesPerHour Property

The air changes per hour.

## Syntax (C#)
```csharp
public double AirChangesPerHour { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The value should be between [0.0,10000].